; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 80)
	(= (value c1) 99)
	(= (value c2) 11)
	(= (value c3) 71)
	(= (value c4) 36)
	(= (value c5) 66)
	(= (value c6) 20)
	(= (value c7) 27)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 7
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 7
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 4 of 7
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 7
5. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 7
6. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 4 of 7
7. (increment c4)
   changed: (value c4) from 36 to 42
   goals met: 4 of 7
8. (increment c4)
   changed: (value c4) from 42 to 48
   goals met: 4 of 7
9. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 7
10. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 7
11. (increment c4)
   changed: (value c4) from 48 to 54
   goals met: 4 of 7
12. (increment c4)
   changed: (value c4) from 54 to 60
   goals met: 4 of 7
13. (increment c4)
   changed: (value c4) from 60 to 66
   goals met: 3 of 7
14. (increment c4)
   changed: (value c4) from 66 to 72
   goals met: 4 of 7
15. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 4 of 7
16. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 7
17. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 7
18. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 7
19. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 7
20. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 4 of 7
21. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 4 of 7
22. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 4 of 7
23. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 4 of 7
24. (increment c6)
   changed: (value c6) from 20 to 28
   goals met: 3 of 7
25. (increment c6)
   changed: (value c6) from 28 to 36
   goals met: 3 of 7
26. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 7
27. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 7
28. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 3 of 7
29. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 3 of 7
30. (increment c6)
   changed: (value c6) from 36 to 46
   goals met: 3 of 7
31. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 7
32. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 7
33. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 3 of 7
34. (increment c7)
   changed: (value c7) from 27 to 32
   goals met: 3 of 7
35. (increment c7)
   changed: (value c7) from 32 to 37
   goals met: 3 of 7
36. (increment c7)
   changed: (value c7) from 37 to 42
   goals met: 3 of 7
37. (increment c7)
   changed: (value c7) from 42 to 47
   goals met: 4 of 7
38. (increment c6)
   changed: (value c6) from 46 to 56
   goals met: 3 of 7
39. (increment c7)
   changed: (value c7) from 47 to 52
   goals met: 3 of 7
40. (increment c6)
   changed: (value c6) from 56 to 66
   goals met: 3 of 7
41. (increment c7)
   changed: (value c7) from 52 to 57
   goals met: 3 of 7
42. (increment c7)
   changed: (value c7) from 57 to 62
   goals met: 3 of 7
43. (increment c7)
   changed: (value c7) from 62 to 67
   goals met: 4 of 7
44. (increment c6)
   changed: (value c6) from 66 to 76
   goals met: 4 of 7
45. (increment c7)
   changed: (value c7) from 67 to 72
   goals met: 4 of 7
46. (increment c7)
   changed: (value c7) from 72 to 77
   goals met: 5 of 7
47. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 7
48. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 5 of 7
49. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 5 of 7
50. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 7
51. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 7
52. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 5 of 7
53. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 5 of 7
54. (increment c2)
   changed: (value c2) from 11 to 18
   goals met: 5 of 7
55. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 5 of 7
56. (increment c2)
   changed: (value c2) from 18 to 26
   goals met: 5 of 7
57. (increment c2)
   changed: (value c2) from 26 to 34
   goals met: 5 of 7
58. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 5 of 7
59. (increment c2)
   changed: (value c2) from 34 to 43
   goals met: 5 of 7
60. (increment c2)
   changed: (value c2) from 43 to 52
   goals met: 5 of 7
61. (increment c2)
   changed: (value c2) from 52 to 61
   goals met: 5 of 7
62. (increment c2)
   changed: (value c2) from 61 to 70
   goals met: 5 of 7
63. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 5 of 7
64. (increment c2)
   changed: (value c2) from 70 to 80
   goals met: 4 of 7
65. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 7
66. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 7
67. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 7
68. (decrement c2)
   changed: (value c2) from 80 to 70
   goals met: 5 of 7
69. (decrement c1)
   changed: (value c1) from 99 to 96
   goals met: 5 of 7
70. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 7
71. (increment c2)
   changed: (value c2) from 70 to 80
   goals met: 4 of 7
72. (decrement c1)
   changed: (value c1) from 96 to 92
   goals met: 4 of 7
73. (decrement c2)
   changed: (value c2) from 80 to 70
   goals met: 5 of 7
74. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 5 of 7
75. (decrement c1)
   changed: (value c1) from 92 to 87
   goals met: 5 of 7
76. (decrement c1)
   changed: (value c1) from 87 to 82
   goals met: 5 of 7
77. (decrement c1)
   changed: (value c1) from 82 to 77
   goals met: 4 of 7
78. (decrement c1)
   changed: (value c1) from 77 to 72
   goals met: 4 of 7
79. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 7
80. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 7
81. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 7
82. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 4 of 7
83. (decrement c1)
   changed: (value c1) from 72 to 67
   goals met: 5 of 7
84. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 5 of 7
85. (decrement c0)
   changed: (value c0) from 80 to 75
   goals met: 5 of 7
86. (decrement c0)
   changed: (value c0) from 75 to 70
   goals met: 5 of 7
87. (decrement c0)
   changed: (value c0) from 70 to 65
   goals met: 6 of 7
88. (decrement c4)
   changed: (value c4) from 72 to 65
   goals met: 6 of 7
89. (decrement c3)
   changed: (value c3) from 71 to 69
   goals met: 5 of 7
90. (decrement c3)
   changed: (value c3) from 69 to 67
   goals met: 5 of 7
91. (decrement c3)
   changed: (value c3) from 67 to 65
   goals met: 5 of 7
92. (decrement c3)
   changed: (value c3) from 65 to 63
   goals met: 6 of 7
93. (decrement c2)
   changed: (value c2) from 70 to 60
   goals met: 6 of 7
94. (decrement c1)
   changed: (value c1) from 67 to 62
   goals met: 5 of 7
95. (decrement c1)
   changed: (value c1) from 62 to 57
   goals met: 6 of 7
96. (decrement c0)
   changed: (value c0) from 65 to 60
   goals met: 6 of 7
97. (decrement c0)
   changed: (value c0) from 60 to 55
   goals met: 7 of 7
